# ******************************************************************************
# Category  : Grammar of Pandas
# Chapter   : 01 基本操作
# Title     : 04 データ入出力
# Created by: Owner
# Created on: 2020/12/20
# ******************************************************************************


# ＜目次＞
# 0 準備
# 1 CSVのインポート


# 0 準備 -----------------------------------------------------------------------

# ライブラリ
import os
import pandas as pd


# 1 パスの取得 ----------------------------------------------------------------

# カレントパスの取得
cd = os.getcwd()

# パスの結合
path = os.path.join(cd, 'iris.csv')

# パスのセパレータ変換
path_base = "C:/Python".replace("/", os.sep)


# 1 CSVのインポート -------------------------------------------------------------

# パス指定
cd = os.getcwd()
name = 'iris.csv'
path = os.path.join(cd, 'grammar', 'pandas', 'csv', name)

# CSV読み込み
df = pd.read_csv(path)


