# ******************************************************************************
# Course      : デザインパターン・マスター講座
# Chapter     : 3 Python基本文法講座
# Theme       : 17 all / any
# Creat Date  : 2022/2/11
# Final Update:
# URL         : https://www.udemy.com/course/python-mx/
# ******************************************************************************


# ＜概要＞
# - allやanyはif文でよく用いられる


# ＜目次＞
# 1 allを持つ条件文
# 2 anyを持つ条件文


# 1 allを持つ条件文 ----------------------------------------------

if all((30 < 10, 10 < 20, 'a' == 'a')):
    print('allの中の処理')
else:
    print('Falseの処理')


# 2 anyを持つ条件文 ----------------------------------------------

if not any((30 < 20, 10 < 5, 'a' == 'b')):
    print('anyの中の処理')
else:
    print('Falseの処理')
