# ******************************************************************************
# Course      : Python3.8マスター講座
# Chapter     : 15 科学技術計算ライブラリ
# Theme       : Scipyによる積分
# Creat Date  : 2022/2/20
# Final Update:
# URL         : https://www.udemy.com/course/python-python/
# ******************************************************************************


# ＜概要＞
# - ScipyはNumpyをベースに作成されたライブラリで具体的なアルゴリズムが実装されている
# - ここでは積分を確認する


# ＜目次＞
# 0 準備
# 1 積分


# 0 準備 ----------------------------------------------------------

from scipy.integrate import quad
import numpy as np


# 1 積分 -------------------------------------------------------------

def f(x):
    return 2 * x + 3


print(quad(f, 1, 2))

print(quad(lambda x: np.sin(x), 0, np.pi))
