# ******************************************************************************
# Course      : Python3.8マスター講座
# Chapter     : 15 科学技術計算ライブラリ
# Theme       : ビット演算
# Creat Date  : 2022/2/17
# Final Update:
# URL         : https://www.udemy.com/course/python-python/
# ******************************************************************************


# ＜概要＞
# - ビット演算の基本を確認する


# ＜目次＞
# 0 準備
# 1 ビット演算と論理演算
# 2 論理演算


# 0 準備 ----------------------------------------------------------

# ライブラリ
import numpy as np


# 1 ビット演算 -----------------------------------------------

# 配列作成
# 1 => 000000001 -> 11111110
x = np.array([0, 1, 0, 1])
y = np.array([0, 0, 1, 1])

# ビット演算
# --- 論理積
# --- 論理和
# --- 排他的論理和
# --- xとyの否定(0 -> 1, 1->0)
print(np.bitwise_and(x, y))
print(np.bitwise_or(x, y))
print(np.bitwise_xor(x, y))
print(np.bitwise_not(x))


# 2 論理演算 -----------------------------------------------

# ＜ポイント＞
# - 通常は以下の演算子を用いて論理演算を行うケースが多い


# 論理演算
# --- 論理積
# --- 論理和
# --- 排他的論理和
# --- 否定
print(x & y)
print(x | y)
print(x ^ y)
print(~ x)
