# ******************************************************************************
# Course      : Python3.8マスター講座
# Chapter     : 15 科学技術計算ライブラリ
# Theme       : 線形代数1
# Creat Date  : 2022/2/18
# Final Update:
# URL         : https://www.udemy.com/course/python-python/
# ******************************************************************************


# ＜概要＞
# - 基本的な線形代数の演算を確認する


# ＜目次＞
# 0 準備
# 1 内積
# 2 複数行列の内積
# 3 ベクトルの内積/直積/外積


# 0 準備 ----------------------------------------------------------

# ライブラリ
import numpy as np


# 1 内積 -----------------------------------------------------------

# ドット関数
# --- スカラー同士の場合は単なる掛け算
print(np.dot(8, 5))

# データ作成
a = np.array([[1, 2], [3, 4]])
b = np.array([[5, 6], [9, 3]])
print(a)
print(b)

# # 内積
print(np.dot(a, b))


# 2 複数行列の内積 ---------------------------------------------------

# データ作成
a = np.random.rand(10, 5)
b = np.random.rand(5, 2)
c = np.random.rand(2, 3)
d = np.random.rand(3, 4)
print(a)
print(b)
print(c)
print(d)

# いっぺんに内積をとる
e = np.linalg.multi_dot([a, b, c, d])
print(e)


# 3 ベクトルの内積/直積/外積 ---------------------------------------------

# データ作成
d = np.array([1, 2, 3])
e = np.array([4, 5, 6])
print(d)
print(e)

# ベクトルの内積
print(np.inner(d, e))

# ベクトルの外積
print(np.outer(d, e))

# ベクトルの直積
print(np.cross(d, e))
