# ******************************************************************************
# Course      : Python3.8マスター講座
# Chapter     : 15 科学技術計算ライブラリ
# Theme       : 線形代数2
# Creat Date  : 2022/2/18
# Final Update:
# URL         : https://www.udemy.com/course/python-python/
# ******************************************************************************


# ＜概要＞
# - 基本的な線形代数の演算を確認する


# ＜目次＞
# 0 準備
# 1 行列式
# 2 逆行列
# 3 線形方程式による連立方程式
# 4 QR分解


# 0 準備 ----------------------------------------------------------

# ライブラリ
import numpy as np


# 1 行列式 ----------------------------------------------------------

# データ作成
a = np.array([[5, 6], [3, 4]])
print(a)

# 行列式の計算
print(np.linalg.det(a))


# 2 逆行列 ---------------------------------------------------------

# データ作成
a = np.array([[5, 6], [3, 4]])
print(a)

# 逆行列の計算
b = np.linalg.inv(a)

# 確認
print(b)
print(b.dot(a))


# 3 線形方程式による連立方程式 -----------------------------------------

# データ作成
a = np.array([[2, 1, -3], [4, -2, 1], [3, 5, -2]])
b = np.array([-4, 9, 5])

# 線形方程式を解く
x = np.linalg.solve(a, b)

# 確認
print(f'{a=}')
print(f'{b=}')
print(f'{x=}')

# 検証
print(a.dot(x))


# 4 QR分解 ----------------------------------------------------------

# データ作成
a = np.random.rand(3, 3)

# QR分解
q, r = np.linalg.qr(a)

# 確認
print(f'{a=}')
print(f'{q=}')
print(f'{r=}')
