# ******************************************************************************
# Book     : Pythonプロフェッショナル大全
# Chapter  : 10 コンフィグとロギング
# Section  : 2 適切なロギングの書き方
# Theme    : 19 ログを辞書型で出力
# Date     : 2022/09/15
# URL      : https://www.kadokawa.co.jp/product/322201000299/
# ******************************************************************************


# ＜ポイント＞
# - ログの書き方は文字列で出力する方法以外に辞書型を使う方法もある


# ＜目次＞
# 0 準備
# 1 ログの出力


# 0 準備 -------------------------------------------------------------------

# ライブラリ
import logging

# ロガーの作成
logger = logging.getLogger(__name__)


# 1 ログの出力 --------------------------------------------------------------

# 文字列で出力
logger.error('Api call is failed')

# 辞書で出力
logger.error({
    'action': 'create',
    'status': 'fail',
    'message': 'Api call is failed'
})
