# ******************************************************************************
# Book     : Pythonプロフェッショナル大全
# Chapter  : 11 Webとネットワーク
# Section  : 1 Webでよく使うファイル形式
# Theme    : 2 JSONに書き込み
# Date     : 2022/09/17
# URL      : https://www.kadokawa.co.jp/product/322201000299/
# ******************************************************************************


# ＜ポイント＞
# - JSONファイルを書き込む際はdumpメソッドを使用する


# ＜目次＞
# 0 準備
# 1 JSONファイルの書き込み


# 0 準備 ------------------------------------------------------------------

# ライブラリ
import json
import os

# ディレクトリ変更
os.chdir('./practice/lesson11')
os.getcwd()


# 1 JSONファイルの書き込み --------------------------------------------------

# 辞書型の作成
j = {
    "employee":
        [
            {"id": 111, "name": "Mike"},
            {"id": 222, "name": "Nancy"}
        ]
}

# JSONファイルの書き込み
with open('test.json', 'w') as f:
    json.dump(j, f)
