# ******************************************************************************
# Book     : Pythonプロフェッショナル大全
# Chapter  : 11 Webとネットワーク
# Section  : 1 Webでよく使うファイル形式
# Theme    : 4 JSONを辞書に変換
# Date     : 2022/09/17
# URL      : https://www.kadokawa.co.jp/product/322201000299/
# ******************************************************************************


# ＜ポイント＞
# - JSONファイルを読み込む際に辞書型に変換するにはloadsメソッドを使う


# ＜目次＞
# 0 準備
# 1 JSONを辞書に変換


# 0 準備 ------------------------------------------------------------------

# ライブラリ
import json
import os

# ディレクトリ変更
os.chdir('./practice/lesson11')


# 1 JSONを辞書に変換 -------------------------------------------------------

# 辞書型の作成
j = {
    "employee":
        [
            {"id": 111, "name": "Mike"},
            {"id": 222, "name": "Nancy"}
        ]
}

# JSONオブジェクトの作成
a = json.dumps(j)
print(a)

# 辞書型に変換
b = json.loads(a)
print(b)
